// CommandPalette.js
// Version: 0.6.3
// Language: English (1033)

[AkelPad]
4101 = "File: New\tCtrl+N"
4102 = "File: New Window\tCtrl+Shift+N"
4103 = "File: Open...\tCtrl+O"
4104 = "File: Reopen\tF5"
4105 = "File: Save\tCtrl+S | F2"
4106 = "File: Save As...\tCtrl+Shift+S"
4107 = "File: Print Setup..."
4108 = "File: Print...\tCtrl+P"
4109 = "File: Exit\tAlt+F4"
4110 = "File: Save All\tCtrl+Alt+F2"
4111 = "File: Save All As..."
4113 = "File: Print"
4114 = "File: Print Preview..."
4121 = "File: Redetect Code Page\tAlt+F5"
4122 = "File: Reopen As ANSI\tAlt+W"
4123 = "File: Reopen As OEM\tAlt+D"
4124 = "File: Reopen As KOI-R\tAlt+K"
4125 = "File: Reopen As UTF-16 LE\tAlt+L"
4126 = "File: Reopen As UTF-16 BE\tAlt+B"
4127 = "File: Reopen As UTF-8\tAlt+U"
4131 = "File: Save As ANSI\tShift+Alt+W"
4132 = "File: Save As OEM\tShift+Alt+D"
4133 = "File: Save As KOI-R\tShift+Alt+K"
4134 = "File: Save As UTF-16 LE\tShift+Alt+L"
4135 = "File: Save As UTF-16 BE\tShift+Alt+B"
4136 = "File: Save As UTF-8\tShift+Alt+U"
4137 = "File: Save As UTF-8 without BOM"
4140 = "Edit: Show codepages context menu...\tF12"
4151 = "Edit: Undo\tCtrl+Z"
4152 = "Edit: Redo\tCtrl+Shift+Z"
4153 = "Edit: Cut\tCtrl+X"
4154 = "Edit: Copy\tCtrl+C"
4155 = "Edit: Paste\tCtrl+V"
4156 = "Edit: Delete\tDel"
4157 = "Edit: Select all\tCtrl+A"
4158 = "Edit: Find...\tCtrl+F"
4159 = "Edit: Find Next (down)\tF3"
4160 = "Edit: Find Previous (up)\tShift+F3"
4161 = "Edit: Replace...\tCtrl+H | Ctrl+R"
4162 = "Edit: Go to...\tCtrl+G"
4163 = "Edit: Insert Character...\tCtrl+I"
4164 = "Edit: Tab Indent"
4165 = "Edit: Tab Indent if several lines selected"
4166 = "Edit: Tab Unindent if several lines selected else Tab Indent"
4167 = "Edit: Tab Unindent if several lines selected"
4168 = "Edit: Space Indent"
4169 = "Edit: Space Indent if several lines selected"
4170 = "Edit: Space Unindent if several lines selected else Space Indent"
4171 = "Edit: Space Unindent only if several lines selected"
4172 = "Edit: Delete first char"
4173 = "Edit: Delete first char only if selection not empty"
4174 = "Edit: Delete trailing whitespaces\tAlt+Backspace"
4175 = "Edit: Convert text to `UPPERCASE`\tCtrl+6"
4176 = "Edit: Convert text to `lowercase`\tCtrl+7"
4177 = "Edit: Convert text to `Sentence case`\tCtrl+8"
4178 = "Edit: Convert text to `Title Case`\tCtrl+9"
4179 = "Edit: Convert text to `iNVERT cASE`\tCtrl+0"
4180 = "Edit: Cycle case conversions\tCtrl+5"
4182 = "Edit: Recode...\tAlt+R"
4183 = "Edit: Insert Date\tCtrl+D"
4184 = "Edit: Windows newline format (CRLF)"
4185 = "Edit: Unix newline format (LF)"
4186 = "Edit: Mac newline format (CR)"
4190 = "Edit: Insert/Overtype mode"
4191 = "Edit: Paste as ANSI text\tCtrl+Shift+V"
4192 = "Edit: Columnar paste\tAlt+V"
4193 = "Edit: Paste text after caret"
4194 = "Edit: Paste text according to the selection case"
4195 = "Edit: Delete all whitespaces in selection"
4196 = "Edit: Insert new line with indent (`Keep left spaces` is off)"
4197 = "Edit: Delete current line\tCtrl+Y"
4198 = "Edit: Move caret to opposite end of selection\tAlt+\"
4199 = "Edit: Move caret to prev. location (navigate backward)\tAlt+,"
4200 = "Edit: Move caret to next location (navigate forward)\tAlt+."
4201 = "View: Font..."
4202 = "View: Colors..."
4204 = "View: Increase Font 1pt\tCtrl+Num+"
4205 = "View: Decrease Font 1pt\tCtrl+Num-"
4206 = "View: Restore font to size at startup\tCtrl+Num*"
4209 = "View: Word Wrap (on/off)\tCtrl+U"
4210 = "View: Always on top (on/off)\tCtrl+T"
4211 = "View: Show Status Bar (on/off)"
4212 = "View: Split window into four panes"
4213 = "View: Split window into two vertical panes"
4214 = "View: Split window into two horizontal panes"
4215 = "View: Split window (on/off)"
4216 = "View: Read only (on/off)"
4251 = "Options: Execute a command...\tCtrl+F5"
4252 = "Options: Preserve file time (on/off)"
4253 = "Options: Watch file change (on/off)"
4254 = "Options: Keep left spaces (on/off)\tCtrl+L"
4255 = "Options: Single open file (on/off)"
4256 = "Options: Single open program (on/off)"
4259 = "Options: Plugins...\tAlt+P"
4260 = "Options: Settings..."
4261 = "Options: SDI window mode"
4262 = "Options: MDI window mode"
4263 = "Options: Pseudo MDI window mode"
4301 = "Options: Tab List is above the main window"
4302 = "Options: Tab List is below the main window"
4303 = "Options: Hide Tab List"
4304 = "Options: Standard Tab List style"
4305 = "Options: Buttons Tab List style"
4306 = "Options: Flat buttons Tab List style"
4307 = "Window: MDI windows - horizontal tile"
4308 = "Window: MDI windows - vertical tile"
4309 = "Window: MDI windows - cascade"
4310 = "Options: Switch tabs: next-previous"
4311 = "Options: Switch tabs: right-left"
4316 = "Window: Activate next tab\tCtrl+Tab"
4317 = "Window: Activate previous tab\tCtrl+Shift+Tab"
4318 = "Window: Close current tab\tCtrl+F4 | Ctrl+W"
4319 = "Window: Close all tabs"
4320 = "Window: Close all tabs but active"
4321 = "Window: Close all unmodified tabs"
4322 = "Window: Clone current tab"
4323 = "Window: Copy current tab file path"
4324 = "File: Close file"
4325 = "File: Close file and exit (SDI) or close current tab (MDI/PMDI)"
4327 = "Window: Select window...\tF10"
4331 = "Window: Restore/Maximize main window\tAlt+Enter"
4332 = "Window: Activate next dialog window\tF6"
4333 = "Window: Activate previous dialog window\tShift+F6"
4341 = "View: Activate next pane (split window)\tF9"
4342 = "View: Activate previous pane (split window)\tShift+F9"
4351 = "Help: About..."
4352 = "Help: Manual..."
4353 = "Help: Check Updates (AkelUpdater)..."
5001 = "File: Delete dead files from the `Recent files` list"

[Plugins]
"Clipboard::Capture" = "Clipboard: Capture..."
"Clipboard::Paste" = "Clipboard: Paste text"
"Clipboard::PasteSerial" = "Clipboard: Paste serial number"
"Clipboard::SelAutoCopy" = "Clipboard: Selection auto-copy on/off"
"Clipboard::Settings" = "Clipboard: Settings..."
"Coder::AutoComplete" = "Coder: Autocompletion on/off"
"Coder::CodeFold" = "Coder: Code folding on/off"
'"Coder::CodeFold", 1' = "Coder: List of folds on/off"
"Coder::HighLight" = "Coder: Syntax highlighting on/off"
"Coder::Settings" = "Coder: Settings..."
"ContextMenu::Main" = "ContextMenu: Configure..."
"ContextMenu::Show" = "ContextMenu: Show..."
"Exit::Main" = "Exit: Enable/Disable (exit by Esc)"
"Exit::Settings" = "Exit: Settings..."
"Explorer::Main" = "Explorer: Explorer panel on/off"
'"Explorer::Main", 1, ""' = "Explorer: Go to Current file"
'"Explorer::Main", 1, "%a\"' = "Explorer: Go to AkelPad folder"
'"Explorer::Main", 1, "%a\AkelFiles\Docs\"' = "Explorer: Go to Docs folder"
'"Explorer::Main", 1, "%a\AkelFiles\Plugs\"' = "Explorer: Go to Plugs folder"
'"Explorer::Main", 1, "%a\AkelFiles\Plugs\Scripts"' = "Explorer: Go to Scripts folder"
`"Explorer::Main", 1, "%USERPROFILE%"` = "Explorer: Go to %UserProfile%"
"Fonts::Main" = "Fonts: Enable/Disable"
"Format::Decrypt" = "Format: Decrypt selection..."
"Format::Encrypt" = "Format: Encrypt selection..."
"Format::LineFixWrap" = "Format: Insert end-of-line character in wrap places"
"Format::LineGetDuplicates" = "Format: Extract duplicate lines"
"Format::LineGetUnique" = "Format: Extract unique lines"
"Format::LineRemoveDuplicates" = "Format: Remove duplicate lines"
"Format::LineReverse" = "Format: Reverse line order"
"Format::LineSortIntAsc" = "Format: Sort lines by integer ascending"
"Format::LineSortIntDesc" = "Format: Sort lines by integer descending"
"Format::LineSortStrAsc" = "Format: Sort lines by string ascending"
"Format::LineSortStrDesc" = "Format: Sort lines by string descending"
"Format::LinkExtract" = "Format: Extract links from HTML text"
"FullScreen::Main" = "FullScreen: Enable/Disable"
"HexSel::Main" = "HexSel: HexSel panel on/off"
"Hotkeys::Main" = "Hotkeys: Hotkeys..."
"LineBoard::Main" = "LineBoard: Enable/Disable"
"LineBoard::Settings" = "LineBoard: Settings..."
"Log::Output" = "Log: Output panel on/off"
"Log::Settings" = "Log: Settings..."
"Log::Watch" = "Log: Watch in real time on/off"
"Macros::Main" = "Macros: Macros..."
"MinimizeToTray::Always" = "MinimizeToTray: Always minimize to tray on/off"
"MinimizeToTray::Now" = "MinimizeToTray: Now"
"QSearch::DialogSwitcher" = "QSearch: Dialog switcher on/off"
"QSearch::QSearch" = "QSearch: QSearch panel\tF7"
"QSearch::SelFindNext" = "QSearch: Find (selected text) next"
"QSearch::SelFindPrev" = "QSearch: Find (selected text) previous"
"QSearch::GoToNextFindAllMatch" = "QSearch: Go To Next Find All Match\tF4"
"QSearch::GoToPrevFindAllMatch" = "QSearch: Go To Previous Find All Match\tShift+F4"
`"QSearch::FindNext", 1` = "QSearch: Quick Find Next or Select Word\tCtrl+F3"
`"QSearch::FindPrev", 1` = "QSearch: Quick Find Previous or Select Word\tCtrl+Shift+F3"
`"QSearch::FindAll", 1` = "QSearch: Quick Find All or Select Word\tCtrl+Alt+F3"
"RecentFiles::DeleteNonExistent" = "RecentFiles: Delete non-existent"
"RecentFiles::Manage" = "RecentFiles: Manage..."
"RecentFiles::Show" = "RecentFiles: Show menu..."
"SaveFile::AutoSave" = "SaveFile: Autosaving on/off"
"SaveFile::SaveNoBOM" = "SaveFile: Save without BOM on/off"
"SaveFile::Settings" = "SaveFile: Settings..."
"Scripts::Main" = "Scripts: Scripts..."
"Scroll::AlignCaret" = "Scroll: Align caret on/off"
"Scroll::AutoFocus" = "Scroll: Autofocus on/off"
"Scroll::AutoScroll" = "Scroll: Autoscrolling on/off"
"Scroll::NoScroll" = "Scroll: No scroll operations on/off"
"Scroll::Settings" = "Scroll: Settings..."
"Scroll::SyncHorz" = "Scroll: Horizontal synchronization on/off"
"Scroll::SyncVert" = "Scroll: Vertical synchronization on/off"
"Sessions::Main" = "Sessions: Sessions..."
'"Sessions::Main", 10' = "Sessions: Enable/Disable"
"SmartMath::ToggleSmartMath" = "SmartMath: ToggleSmartMath"
"SmartSel::NoSelEOL" = "SmartSel: Exclude EOL from selection on/off"
"SmartSel::Settings" = "SmartSel: Settings..."
"SmartSel::SmartBackspace" = "SmartSel: Smart Backspace on/off"
"SmartSel::SmartEnd" = "SmartSel: Smart End on/off"
"SmartSel::SmartHome" = "SmartSel: Smart Home on/off"
"SmartSel::SmartUpDown" = "SmartSel: Smart Up/Down on/off"
"Sounds::Main" = "Sounds: Enable/Disable"
"Sounds::Settings" = "Sounds: Settings..."
"SpecialChar::Main" = "SpecialChar: Enable/Disable"
"SpecialChar::Settings" = "SpecialChar: Settings..."
"Speech::Main" = "Speech: Speech panel"
"SpellCheck::Background" = "SpellCheck: Background check"
"SpellCheck::CheckDocument" = "SpellCheck: Check document"
"SpellCheck::CheckSelection" = "SpellCheck: Check selection"
"SpellCheck::Settings" = "SpellCheck: Settings..."
"SpellCheck::Suggest" = "SpellCheck: Suggest word"
"Stats::Main" = "Stats: Stats..."
"Templates::Main" = "Templates: Enable/Disable"
"Templates::Open" = "Templates: Open..."
"ToolBar::Main" = "ToolBar: Enable/Disable"
"XBrackets::GoToMatchingBracket" = "XBrackets: Go to matching bracket\tCtrl+B"
"XBrackets::GoToNearestBracket" = "XBrackets: Go to nearest bracket\tCtrl+M"
"XBrackets::Main" = "XBrackets: Enable/Disable"
"XBrackets::SelToMatchingBracket" = "XBrackets: Select to matching bracket\tCtrl+Shift+B"
"XBrackets::SelToNearestBrackets" = "XBrackets: Select to nearest brackets\tCtrl+Shift+M"
"XBrackets::Settings" = "XBrackets: Settings..."
// CodeFold operations...
"Coder::CodeFold::CurrentCollapse" = "Code Folding: Collapse/Expand the current level\tCtrl+="
"Coder::CodeFold::CurrentGoBegin" = "Code Folding: Go to the beginning of the current level\tCtrl+["
"Coder::CodeFold::CurrentGoEnd" = "Code Folding: Go to the end of the current level\tCtrl+]"
"Coder::CodeFold::CurrentSelect" = "Code Folding: Select the current level\tCtrl+\"
"Coder::CodeFold::AllCollapse" = "Code Folding: Collapse/Expand all levels\tCtrl+Alt+="
"Coder::CodeFold::AllNextLevel" = "Code Folding: Go to the next block\tCtrl+Alt+]"
"Coder::CodeFold::AllPrevLevel" = "Code Folding: Go to the previous block\tCtrl+Alt+["
"Coder::CodeFold::FindRootLevel" = "Code Folding: Find the root level"
// Syntax Themes...
'"Coder::Settings", 1, "1s"'   = "Syntax Theme: 1с"
'"Coder::Settings", 1, "asm"'  = "Syntax Theme: Assembler"
'"Coder::Settings", 1, "au3"'  = "Syntax Theme: AutoIt"
'"Coder::Settings", 1, "awk"'  = "Syntax Theme: Awk"
'"Coder::Settings", 1, "bat"'  = "Syntax Theme: Bat"
'"Coder::Settings", 1, "cpp"'  = "Syntax Theme: C++ (cpp)"
'"Coder::Settings", 1, "cs"'   = "Syntax Theme: C# (cs)"
'"Coder::Settings", 1, "css"'  = "Syntax Theme: CSS"
'"Coder::Settings", 1, "html"' = "Syntax Theme: HTML"
'"Coder::Settings", 1, "ini"'  = "Syntax Theme: Ini"
'"Coder::Settings", 1, "iss"'  = "Syntax Theme: Inno (iss)"
'"Coder::Settings", 1, "js"'   = "Syntax Theme: JScript"
'"Coder::Settings", 1, "lua"'  = "Syntax Theme: Lua"
'"Coder::Settings", 1, "nsi"'  = "Syntax Theme: NSIS"
'"Coder::Settings", 1, "dpr"'  = "Syntax Theme: Pascal"
'"Coder::Settings", 1, "pl"'   = "Syntax Theme: Perl"
'"Coder::Settings", 1, "php"'  = "Syntax Theme: PHP"
'"Coder::Settings", 1, "ps1"'  = "Syntax Theme: PowerShell (ps1)"
'"Coder::Settings", 1, "py"'   = "Syntax Theme: Python"
'"Coder::Settings", 1, "rc"'   = "Syntax Theme: Resource (rc)"
'"Coder::Settings", 1, "sh"'   = "Syntax Theme: Shell (sh)"
'"Coder::Settings", 1, "sql"'  = "Syntax Theme: SQL"
'"Coder::Settings", 1, "vbs"'  = "Syntax Theme: VBScript"
'"Coder::Settings", 1, "xml"'  = "Syntax Theme: XML"
'"Coder::Settings", 1, "?"'    = "Syntax Theme: none"
'"Coder::Settings", 1, "uutxt"' = "Syntax Theme: Text"
// Color Themes...
'"Coder::Settings", 5, "Default"'         = "Color Theme: Default"
'"Coder::Settings", 5, "Active4D"'        = "Color Theme: Active4D"
'"Coder::Settings", 5, "Bespin"'          = "Color Theme: Bespin"
'"Coder::Settings", 5, "Cobalt"'          = "Color Theme: Cobalt"
'"Coder::Settings", 5, "Dawn"'            = "Color Theme: Dawn"
'"Coder::Settings", 5, "Earth"'           = "Color Theme: Earth"
'"Coder::Settings", 5, "iPlastic"'        = "Color Theme: iPlastic"
'"Coder::Settings", 5, "Lazy"'            = "Color Theme: Lazy"
'"Coder::Settings", 5, "Mac Classic"'     = "Color Theme: Mac Classic"
'"Coder::Settings", 5, "Monokai"'         = "Color Theme: Monokai"
'"Coder::Settings", 5, "Obsidian"'        = "Color Theme: Obsidian"
'"Coder::Settings", 5, "Solarized Light"' = "Color Theme: Solarized Light"
'"Coder::Settings", 5, "Solarized Dark"'  = "Color Theme: Solarized Dark"
'"Coder::Settings", 5, "SpaceCadet"'      = "Color Theme: SpaceCadet"
'"Coder::Settings", 5, "Sunburst"'        = "Color Theme: Sunburst"
'"Coder::Settings", 5, "Twilight"'        = "Color Theme: Twilight"
'"Coder::Settings", 5, "Zenburn"'         = "Color Theme: Zenburn"
// Mark...
'"Coder::HighLight", 2, 0, "#9BFFFF", 1, 0, 11' = "Mark: Cyan"
'"Coder::HighLight", 2, 0, "#FFCD9B", 1, 0, 12' = "Mark: Orange"
'"Coder::HighLight", 2, 0, "#FFFF9B", 1, 0, 13' = "Mark: Yellow"
'"Coder::HighLight", 2, 0, "#BE7DFF", 1, 0, 14' = "Mark: Violet"
'"Coder::HighLight", 2, 0, "#88E188", 1, 0, 15' = "Mark: Green"
'"Coder::HighLight", 2, 0, "#A9A9A9", 1, 0, 16' = "Mark: Gray"
'"Coder::HighLight", 2, 0, "#FF5959", 1, 0, 17' = "Mark: Red"
'"Coder::HighLight", 2, 0, "#68A7FF", 1, 0, 18' = "Mark: Blue"
'"Coder::HighLight", 3, 0'                      = "Mark: Remove all marks"
// Special Characters...
'"SpecialChar::Settings", 1, "8", "0", "0", -1, -1'               = "SpecialChar: Show Indent line (vertical)"
'"SpecialChar::Settings", 1, "1,2,3,9,7,4,5,6", "0", "0", -3, -3' = "SpecialChar: Show All symbols"
'"SpecialChar::Settings", 1, "1,2", "0", "0", -3, -3'             = "SpecialChar: Show Space and Tabulation"
'"SpecialChar::Settings", 1, "3,9", "0", "0", -3, -3'             = "SpecialChar: Show New line and End of file"
'"SpecialChar::Settings", 1, "7", "0", "0", -1, -1'               = "SpecialChar: Show Wrap line"
'"SpecialChar::Settings", 1, "4,5,6", "0", "0", -3, -3'           = "SpecialChar: Show VertTab, Form-feed, Null"
// Lineboard...
'"LineBoard::Main", 3, -1' = "LineBoard: Ruler on/off"
'"LineBoard::Main", 17'    = "Bookmarks: Show all bookmarks...\tAlt+Home"
'"LineBoard::Main", 18'    = "Bookmarks: Go to next bookmark\tAlt+PgDn"
'"LineBoard::Main", 19'    = "Bookmarks: Go to previous bookmark\tAlt+PgUp"
'"LineBoard::Main", 15'    = "Bookmarks: Set bookmark\tAlt+Insert"
'"LineBoard::Main", 16'    = "Bookmarks: Delete bookmark\tAlt+Delete"
'"LineBoard::Main", 14'    = "Bookmarks: Delete all bookmarks\tShift+Alt+Delete"

[Scripts]
"" = "Scripts: Run the last called script"
"Calculator.js" = "Scripts: Text calculator"
"ColumnCounter.js" = "Scripts: Column selection counter"
"InsertDate.js" = "Scripts: Insert date"
"InsertFile.js" = "Scripts: Insert file..."
'"Keyboard.js", `-Type=Layout -Direction=En->Ru`'   = "Scripts: Convert keyboard layout En->Ru"
'"Keyboard.js", `-Type=Layout -Direction=Ru->En`'   = "Scripts: Convert keyboard layout Ru->En"
'"Keyboard.js", `-Type=Translit -Direction=En->Ru`' = "Scripts: Transliteration Latin->Cyrillic"
'"Keyboard.js", `-Type=Translit -Direction=Ru->En`' = "Scripts: Transliteration Cyrillic->Latin"
"LinesFilter.js" = "Scripts: Filter lines with regular expressions..."
"RenameFile.js" = "Scripts: Rename current file..."
"SearchReplace.js" = "Scripts: Search/Replace with regular expressions...\tCtrl+Shift+F"
"SpellCheck.js" = "Scripts: Spell check"
"TabSwitch.js" = "Scripts: Tab Switch\tCtrl+Tab"

[Exec]
'explorer /e,/select, "%f"' = "Show current file in Explorer"
'cmd /K cd /D "%d"' = "Open file's directory in cmd"
'cmd /K cd /D "%USERPROFILE%"' = "Open %UserProfile% directory in cmd"
':OpenLngFile()' = "Config: Edit CommandPalette.lng"
